ninety_nine_cats/app/models/cat_rental_request.rb

  def does_not_overlap_approved_request
    if overlapping_approved_requests.exists?(['cat_rental_requests.end_date BETWEEN ? AND ? OR cat_rental_requests.start_date BETWEEN ? AND ?', self.start_date, self.end_date, self.start_date, self.end_date])
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE (cat_rental_requests.cat_id = 21) AND (cat_rental_requests.status = 'APPROVED') AND (cat_rental_requests.end_date BETWEEN '2021-03-01' AND '2021-03-31' OR cat_rental_requests.start_date BETWEEN '2021-03-01' AND '2021-03-31') LIMIT $1  [["LIMIT", 1]]